# Задача 1
# todo: Выведите все элементы, которые меньше 5
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# print([num for num in a if num < 5])
###################################################################################
# Задача 2
# Даны списки:
# todo: Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
#
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
#
# c = []
#
# for sum_a in a:
#     for sum_b in b:
#         if sum_a == sum_b:
#             c.append(sum_b)
#
# print(list(set(c)))
# result = list(set(a) & set(b))
# print(result)
###################################################################################
# Задача 3
# todo: Отсортируйте словарь по значению в порядке возрастания и убывания.
import operator

# d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}
# d = dict(sorted(d.items(), reverse=False))
# result = dict(sorted(d.items(), key=operator.itemgetter(1), reverse=False))
# print(result) #Верный
# print(d)
###################################################################################
# todo:Напишите программу для слияния нескольких словарей в один.
# Задача 4
# dict_a = {1:10, 2:20}
# dict_b = {3:30, 4:40}
# dict_c = {5:50, 6:60}
# result = {**dict_a, **dict_b, **dict_c}
# print(result)
###################################################################################
# Задача 5
# todo: Найдите три ключа с самыми высокими значениями в словаре
my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}
my_dicts = dict(sorted(my_dict.items(), key=operator.itemgetter(1)))
print(my_dicts)
